Repository: caius-kong/mt
Catalog: data_clean/input/old.tmx
Source language: en_us
Languages: fr_fr

source: Use this task to disable endpoints from directly connecting to the Smart Protection Network. Endpoints revert to their previous connection settings for Smart Protection Relays or Smart Protection Servers.
fr_fr: Utilisez cette tâche pour empêcher les points finaux de se connecter directement à Smart Protection Network. Les points finaux reviennent alors à leurs paramètres de connexion précédents pour les Smart Protection Relays ou les serveurs Smart Protection Server.

source: Endpoints that leave the internal network (for example, laptops) may not have consistent access to Smart Protection Servers. {\cs5\f1\cf15\lang1024Use this task to enable endpoints to connect directly to the Smart Protection Network. Endpoints with this setting enabled cannot connect to Smart Protection Servers or Smart Protection Relays for protection. {\cs5\f1\cf15\lang1024Note: After enabling this setting, the Smart Protection Server and Smart Protection Relay settings of endpoints cannot be modified.
fr_fr: Les points finaux qui sortent du réseau interne (par exemple, les ordinateurs portables) risquent de ne pas disposer d'un accès cohérent aux serveurs Smart Protection Server. {\cs5\f1\cf15\lang1024Utilisez cette tâche pour permettre aux points finaux de se connecter directement à Smart Protection Network. Les points finaux pour lesquels ce paramètre est activé ne peuvent pas se connecter aux serveurs Smart Protection Server ou aux Smart Protection Relays pour bénéficier d'une protection. {\cs5\f1\cf15\lang1024 Remarque : après avoir activé ce paramètre, vous ne pourrez pas modifier les paramètres Smart Protection Server et Smart Protection Relay des points finaux.

source: Use this task to upload&nbsp;Core Protection Module&nbsp;installation and uninstallation logs on endpoints that cannot install the Core Protection Module on endpoints. The following files are uploaded to the BES server: ClnExtor.log CPMInstall.log setupapi.app.log CPMInstallResult.log CPMsrvInstall.log TmInstall.log CPMsrvISSetup.log CPMISSetup.log OFCISSetup.log ComUnist.log OfcNT.log OfcMsi.log TMFilter.log setupapi.log app_list.txt registry_list.txt By default, the destination folder on the BES Server is: BES Server install directory\UploadManagerData\BufferDir\sha1\last 2 digits of BES client id\BES client id Note: Not all of the logs are uploaded. The logs that do upload depend on the installation status and type.For example, CPMsrvISSetup.log only exists when installing the&nbsp;Core Protection Moduleserver package. ComUnist.log only exists after an uninstallation is performed.
fr_fr: Utilisez cette tâche pour télécharger les journaux d'installation et de désinstallation de Core Protection Module sur des points finaux qui ne peuvent pas installer Core Protection Module sur des points finaux. Les fichiers suivants sont téléchargés sur le serveur BES&nbsp;: ClnExtor.log CPMInstall.log setupapi.app.log CPMInstallResult.log CPMsrvInstall.log TmInstall.log CPMsrvISSetup.log CPMISSetup.log OFCISSetup.log ComUnist.log OfcNT.log OfcMsi.log TMFilter.log setupapi.log app_list.txt registry_list.txt Par défaut, le dossier de destination sur le serveur BES est&nbsp;:répertoire d'installation du serveur BES\UploadManagerData\BufferDir\sha1\2&nbsp;derniers chiffres de l'ID client BES\ID client BES Remarque: tous les journaux ne sont pas téléchargés. Les journaux effectivement téléchargés dépendent de l'état et du type d'installation.Par exemple, CPMsrvISSetup.log existe uniquement lors de l'installation du pack serveur Core Protection Module. ComUnist.log n'existe qu'après une désinstallation.

source: Core Protection Module requires that certain services are running: OfficeScan&nbsp;NT Listener OfficeScanNT RealTime Scan Trend Micro Adapter Service OfficeScanNT Firewall (when CPM version =1.5and Common Firewall isenabled) Unauthorized Change Prevention Service Core Protection Module Data Protection Service Core Protection Module for Mac 2.0 (and later) requires thatthe following services are running: Trend Micro Adapter Service iCore Service Core Protection Module for Mac 1.1 (and before) requires thatthe following services are running: iCorePluginMgr iCore Service The&nbsp;listed computers&nbsp;are not running a required service&nbsp;and/or have incorrectly configuredthe start mode for a service.
fr_fr: Core Protection Module requiert l'exécution de certains services : Service d'écoute d'OfficeScanNT Service de scan en temps réel d'OfficeScanNT Trend Micro Adapter Service Pare-feu d'OfficeScanNT (avec la version1.5de CPM ou supérieure et lorsque le pare-feu commun estactivé) Service de prévention des modifications non autorisées Service de protection des données de Core Protection Module Core Protection Module pour Mac 2.0 (et version supérieure) requiert l'exécution de certains services : Trend Micro Adapter Service Service iCore Core Protection Module pour Mac 1.1 (et version supérieure) requiert l'exécution de certains services : iCorePluginMgr Service iCore Les&nbsp;ordinateurs répertoriés&nbsp;n'exécutent pas un service requis&nbsp;et/ou n'ont pas correctement configuréle mode de démarrage d'un service.

source: Use this task to clear the Windows cache to avoid the "Apply Automatic Updates" error: error.
fr_fr: Utilisez cette tâche pour effacer le cache Windows pour éviter l'erreur «&nbsp;Appliquer les mises à jour automatiques&nbsp;»: erreur.

source: This hot fix resolves the following issue:&nbsp;&nbsp; Issue:&nbsp;&nbsp;&nbsp; The Microsoft(TM) Windows(TM) Security Center on Windows Vista and&nbsp;Windows 7 does not&nbsp;recognize Core Protection Module 1.6 clients.Solution: Hot fix 0004 imports a custom fixlet for the Endpoint Security Platform to enable Core Protection Module 1.6 clients to report their status to the Windows Security Center/Action Center correctly. Installation:===================================================================== To install this hot fix: 1. Use the Endpoint Security Platform console to import the "CPM_Hotfix_0004.bes" fixlet as a custom fixlet. A new fixlet named "Core Protection Module - Windows Security Reporting Issue" is installed. 2. The fixlet automatically detects the computers that encounter the issue. Run the fixlet on these computers.
fr_fr: Ce correctif de type hotfix résout les problèmes suivants&nbsp;:&nbsp;&nbsp; Problème&nbsp;:&nbsp;&nbsp;&nbsp; Microsoft(TM) Windows(TM) Security Center sur Windows Vista et&nbsp;Windows 7 ne reconnaissent&nbsp;pas les clients 1.6 de Core Protection Module.Solution&nbsp;: Hot fix 0004 importe un fixlet personnalisé pour Endpoint Security Platform pour permettre aux clients 1.6 de Core Protection Module de signaler leur état correctement au Centre de sécurité /Centre de maintenance de Windows. Installation&nbsp;:===================================================================== &nbsp;&nbsp; Pour installer ce hot fix: 1. Utilisez la console de la plate-forme Sécurité des points finaux pour importer le fixlet "CPM_Hotfix_0004.bes" comme fixlet personnalisé. Un nouveau fixlet nommé "Core Protection Module - Windows Security Reporting Issue" est installé. 2. Le fixlet détecte automatiquement les ordinateurs qui rencontrent ce problème. Exécutez le fixlet sur ces ordinateurs.

source: This&nbsp;task willdeploy NTRtScan.exe version 10.58.0.1016. This&nbsp;critical patchresolves the following issue: Issue:&nbsp;&nbsp;&nbsp; The Core Protection Module cannot apply automatic updates successfully. This issue occurs when the "IOT_InitializeDeviceAndScanEngineEx" VSAPI function returns a system busy error code while starting preventing the NTRtScan service from starting in some clients. Solution: Critical Patch&nbsp;0001 adds a retry mechanism for the "IOT_InitializeDeviceAndScanEngineEx" VSAPI function and enables NTRtScan to delay its startup process while it waits for the function to start successfully. This allows the NTRtScan service to start without issues and the Core Protection Module to apply automatic updates successfully. [Installation]&nbsp;&nbsp; ===================================================================== To install this critical patch: Run this fixlet to deploy "NTRtScan.exe" version 10.58.0.1016 to clients.&nbsp; The old "NTRtScan.exe" is saved as "NTRtScan.exe.tmp" in the "[Trend Micro folder]\OfficeScan Client folder. You can use this back up file for rollback purposes. [Uninstallation]&nbsp;&nbsp; ===================================================================== &nbsp;&nbsp; To uninstall the fixlet, manually remove the fixlet through the Endpoint Security Platform console. To rollback to the previous "NTRtScan.exe" version:&nbsp;&nbsp; 1. Stop the NTRtScan service.&nbsp;&nbsp; 2. Check if the file "[Trend Micro folder]\OfficeScan Client\NTRtScan.exe.tmp" is existed. If so, remove the "[Trend Micro folder]\OfficeScan Client\ &nbsp;&nbsp; NTRtScan.exe".&nbsp;&nbsp; 3. Open the "[Trend Micro folder]\OfficeScan Client folder and rename the "NTRtScan.exe.tmp" file to "NTRtScan.exe". 4. Start the NTRtScan service.
fr_fr: Cette tâche déploiera NTRtScan.exe version10.58.0.1016. Ce patch critique résout les problèmes suivants: Problème&nbsp;: Core Protection Module ne peut pas appliquer les mises à jour avec succès. Ce problème survient lorsque la fonction VSAPI «&nbsp;IOT_initializedeviceandscanengineex renvoie une erreur système occupé pendant le démarrage empêchant le service NTRtScan de démarrer dans certains clients. Solution&nbsp;: Le patch critique&nbsp;0001 ajoute un nouveau mécanisme de réessayage pour la fonction VSAPI «&nbsp;iot_initializedeviceandscanengineex&nbsp;» et permet à NTRtScan de retarder le processus de démarrage pendant qu'il attend que la fonction réussisse son démarrage. Ceci permet au service NTRtScan de démarrer sans problème et au Core Protection Module d'appliquer des mises à jour automatiques avec succès. [Installation]&nbsp;&nbsp; ===================================================================== &nbsp;&nbsp; Pour installer ce patch critique: Exécutez ce fixlet pour déployer «&nbsp;NTRtScan.exe&nbsp;» version&nbsp;10.58.0.1016 sur les clients.&nbsp; L'ancien «&nbsp;NTRtScan.exe&nbsp;» est enregistré comme «&nbsp;NTRtScan.exe.tmp&nbsp;» dans le dossier «&nbsp;[Trend Micro]\OfficeScan Client\&nbsp;». Vous pouvez utiliser ce fichier de sauvegarde pour toute éventuelle rétrogradation. [Désinstallation]&nbsp;&nbsp; ===================================================================== &nbsp;&nbsp; Pour désinstaller le fixlet, supprimez-le manuellement avec la console Endpoint Security Platform. Pour rétrograder vers la version précédente de «&nbsp;NTRtScan.exe&nbsp;»&nbsp;:&nbsp;&nbsp; 1. Arrêtez le service NTRtScan.&nbsp;&nbsp; 2. Vérifiez si le fichier «&nbsp;[Trend Micro folder]\OfficeScan Client\NTRtScan.exe.tmp&nbsp;» existe. Si c'est le cas, supprimez le dossier «&nbsp;Trend Micro folder]\OfficeScan Client\ NTRtScan.exe&nbsp;».&nbsp;&nbsp; 3. Ouvrez le dossier «&nbsp;[Trend Micro folder]\OfficeScan Client\&nbsp;» et renommez le fichier «&nbsp;NTRtScan.exe.tmp&nbsp;» en «NTRtScan.exe». 4. Démarrez le service NTRtScan.

source: {\cs5\f1\cf15\lang1024 This&nbsp;critical patchresolves the following issue: Issue: While migrating Trend Micro Core Protection Module(TM) (CPM) 1.6 to CPM Service Pack 1 for endpoints, the Web Reputation functions do not work on x64 platforms. Solution: Critical Patch 0002 provides a fixlet in the Trend Micro Core Protection Module site. Administrators can deploy this fixlet to resolve this issue. [Installation] ===================================================================== To install this critical patch: Run this fixlet to resolve the Web Reputation issue on x64 platforms. Note: Since this fixlet replaces some files, create backup files. The &nbsp; backup files are "libeay32.dll.tmp", "PccNTUpd.exe.tmp", &nbsp; "ssleay32.dll.tmp" and "TmpxHash.dll.tmp" from the "[Trend &nbsp; Micro folder]\OfficeScan Client folder. You can use these backup files if you need to do a rollback. [Uninstallation] ===================================================================== &nbsp;&nbsp; To uninstall the fixlet, manually remove the fixlet through the Endpoint Security Platform console. To roll back the files: 1. Stop these services in this order: TmListen, NTRtScan and TmAdptrsvr.&nbsp;&nbsp; 2. Check if the "libeay32.dll.tmp", "PccNTUpd.exe.tmp", "ssleay32.dll.tmp" and "TmpxHash.dll.tmp" files are in the "[Trend Micro folder]\OfficeScan Client folder. Once you find these files, remove the "libeay32.dll", "PccNTUpd.exe", "ssleay32.dll" and "TmpxHash.dll" files from the "[Trend Micro folder]\OfficeScan Client folder.&nbsp;&nbsp; 3. Open the "[Trend Micro folder]\OfficeScan Client folder and rename the following files: - From "libeay32.dll.tmp" file to "libeay32.dll" - From "PccNTUpd.exe.tmp" file to "PccNTUpd.exe" - From "ssleay32.dll.tmp" file to "ssleay32.dll" - From "TmpxHash.dll.tmp" file to "TmpxHash.dll". 4. Start these services in this order: TmAdptrsvr, NTRtScan and TmListen.
fr_fr: {\cs5\f1\cf15\lang1024 Ce patch critique résout les problèmes suivants: Problème&nbsp;: lors de la migration de Trend Micro Core Protection Module (TM) (CPM) 1.6 à CPM Service Pack&nbsp;1 pour les points finaux, les fonctions de Réputation des sites Web ne sont pas compatibles avec les plates-formes x64. Solution&nbsp;: le patch critique&nbsp;0002 fournit un fixlet sur le site Trend Micro Core Protection Module. Les administrateurs peuvent déployer cefixlet pour résoudre ce problème. [Installation] =====================================================================Pour installer ce patch critique: Exécutez ce fixlet pour résoudre le problème de Réputation de sites Web sur les plates-formes x64. Remarque&nbsp;: étant donné que ce fixlet remplace certains fichiers, créez des fichiers de sauvegarde. Les fichiers de sauvegarde sont «&nbsp;libeay32.dll.tmp&nbsp;», «&nbsp;PccNTUpd.exe.tmp&nbsp;», «&nbsp;ssleay32.dll.tmp&nbsp;» et «&nbsp;TmpxHash.dll.tmp&nbsp;» du dossier «&nbsp;Trend Micro \OfficeScan Client\». Vous pouvez utiliser ces fichiers de sauvegarde si vous devez effectuer une rétrogradation. [Désinstallation] ===================================================================== Pour désinstaller le fixlet, supprimez-le manuellement avec la console Endpoint Security Platform. Pour rétrograder les fichiers: 1. Arrêtez ces services dans l'ordre suivant&nbsp;: TmListen, NTRtScan et TmAdptrsvr.&nbsp;&nbsp; 2. Vérifiez si les fichiers «&nbsp;libeay32.dll.tmp&nbsp;», «&nbsp;PccNTUpd.exe.tmp&nbsp;», «&nbsp;ssleay32.dll.tmp&nbsp;» et «&nbsp;TmpxHash.dll.tmp&nbsp;» se trouvent dans le dossier «&nbsp;Trend Micro \OfficeScan Client\&nbsp;». Une fois que vous avez trouvé ces fichiers, supprimez «&nbsp;libeay32.dll&nbsp;», «&nbsp;PccNtUpd.exe&nbsp;», «&nbsp;ssleay32.dll&nbsp;» et «&nbsp;TmpxHash.dll&nbsp;» du dossier «&nbsp;Trend Micro \OfficeScan Client\&nbsp;».&nbsp;&nbsp; 3. Ouvrez le dossier «&nbsp;Trend Micro\OfficeScan Client\&nbsp;» et renommez les fichiers suivants: – «&nbsp;libeay32.dll.tmp&nbsp;» en «&nbsp;libeay32.dll&nbsp;» – «&nbsp;PccNTUpd.exe.tmp&nbsp;» en «&nbsp;PccNtUpd.exe&nbsp;» – «&nbsp;ssleay32.dll.tmp&nbsp;» en «&nbsp;ssleay32.dll&nbsp;» – «&nbsp;TmpxHash.dll.tmp&nbsp;» en «&nbsp;TmpxHash.dll&nbsp;».&nbsp;&nbsp; 4. Démarrez ces services dans l'ordre suivant: TmAdptrsvr, NTRtScan et TmListen.

source: Web Reputation requires internet access. In certain network environments the use of a proxy server is needed. Use the action below to configure a proxy server. Important Note:&nbsp;The proxy server password MUST be encrypted prior to use in this action. Download andunzip/extractthe TMCPMEncrypt.exeutility to encrypt a password. Filename: TMCPMEncrypt_1.5.0.1038.zip Size: 185718 SHA1: 28704ae66eef9fc9dc0be92f91d64fe714d40f10 Usage Note: The TMCPMEncrypt.exe command line tool provides the option to generate an encrypted string. The encrypted string can be used for proxy passwords. Example:C:TMCPMEncrypt.exe example_password!CRYPT!31371340370123D94E842AAAA6686E3C187F9E99DB195ED57245D16397E
fr_fr: Réputation de sites Web requiert un accès à Internet. Dans certains environnements réseau, l'utilisation d'un serveur proxy est nécessaire. Utilisez l'action ci-dessous pour configurer un serveur proxy. Remarque importante: Le mot de passe du serveur proxy DOIT être chiffré avant de l'utiliser dans cette action. Téléchargez et décompressez/extrayez l'utilitaire TMCPMEncrypt.exe pour chiffrer un mot de passe. Nom de fichier&nbsp;: TMCPMEncrypt_1.5.0.1038.zip Taille&nbsp;: 185718 SHA1: 28704ae66eef9fc9dc0be92f91d64fe714d40f10 Remarque d'utilisation: l'outil de ligne de commande TMCPMEncrypt.exe fournit l'option de générer une chaîne chiffrée. La chaîne chiffrée peut être utilisée pour les mots de passe de proxy. Exemple&nbsp;: C:TMCPMEncrypt.exe example_password!CRYPT!31371340370123D94E842AAAA6686E3C187F9E99DB195ED57245D16397E

source: Use this task to enable clientto use Smart Protection Server Web Reputation Service. Note: Verify that a Smart Protection Server is readybefore enablingSmart Protection Server Web Reputation Service. If this task is not relevant to clients,please troubleshoot issues from the following links: Check Smart Protection Server list has been deployed to CPM and Mac clients and Smart Protection Relays. Check Web Reputation Service of Smart Protection Server is available. Check protection status of Smart Protection Relays
fr_fr: Utilisez cette tâche pour permettre aux clientsd'utiliser le Service de réputation de sites Web du Smart Protection Server. Remarque&nbsp;: vérifiez qu'un serveur Smart Protection Server est prêt&nbsp;avant d'activerle Service de réputation de sites Web du Smart Protection Server. Si cette tâche n'est pas pertinente pour les clients,veuillez résoudre les problèmes des liens ci-dessous: Vérifiez que la liste des serveurs Smart Protection Server a été déployée sur les clients CPM et Mac, et sur les Smart Protection Relays. Vérifiez que le Service de réputation de sites Web de Smart Protection Server est disponible. Vérifiez l'état de protection des Smart Protection Relays

source: Use the action below to upload all available Web&nbsp;Reputation web threat logs to the&nbsp;TEM Server.{\cs5\f1\cf15\lang1024 Once the log files have been uploaded, you will find them in the following path on theTEM Server: server installation directory\UploadManagerData\BufferDir\sha1\last 2 digits of client id\client id\
fr_fr: Utilisez cette action ci-dessous pour télécharger tous les fichiers journaux disponibles de menaces Internet de Réputation de sites Web sur le serveur&nbsp;TEM.{\cs5\f1\cf15\lang1024 Une fois les fichiers journaux chargés, vous les trouverez sur le serveur&nbsp;TEM en passant par le chemin suivant&nbsp;: répertoire d'installation du serveur\UploadManagerData\BufferDir\sha1\2derniers chiffres de l'ID client\id client\

source: Smart Protection Relay requires the&nbsp;specified computersto reboot. Important Note: When running this action, pay careful attention to the action deployment options in order to avoid restarting the computers at inappropriate times.
fr_fr: Le Smart Protection Relay requiert le redémarrage des ordinateurs spécifiés. Remarque importante: Lors de l'exécution de cette action, faites attention aux options de déploiement de l'action afin d'éviter le redémarrage d'ordinateurs à des moments inopportuns.
